In [1]:
import pandas as pd
from datetime import datetime
from IPython.display import display
import warnings
warnings.filterwarnings("ignore")

Intel MKL WARNING: Support of Intel(R) Streaming SIMD Extensions 4.2 (Intel(R) SSE4.2) enabled only processors has been deprecated. Intel oneAPI Math Kernel Library 2025.0 will require Intel(R) Advanced Vector Extensions (Intel(R) AVX) instructions.
Intel MKL WARNING: Support of Intel(R) Streaming SIMD Extensions 4.2 (Intel(R) SSE4.2) enabled only processors has been deprecated. Intel oneAPI Math Kernel Library 2025.0 will require Intel(R) Advanced Vector Extensions (Intel(R) AVX) instructions.

In [2]:
from spendings import MoneySpendings

In [3]:
df = pd.read_csv("Spendings_csv.csv", parse_dates=["Date"], date_format="%d/%m/%Y")

In [4]:
test = MoneySpendings(df, price_apt=5850)

In [6]:
test.info_by_month(year=2025, month=9)

Spendings in September 2025: 7699.83 sheckels
Spendings in September 2025 with the appartment: 13549.83 sheckels

                       Price  Count    Total
Category      Who
Grocery       Alona  1558.30     20  2295.61
              Pasha   737.31      7
Utility bills Alona   885.55      4   1771.1
              Pasha   885.55      4
Home          Pasha   952.40      7   1126.3
              Alona   173.90      2
Fuel          Pasha   547.31      2   547.31
Treatment     Alona   268.00      3   478.21
              Pasha   210.21      2
Auto          Pasha   428.80      2    428.8
Beauty        Alona   230.00      2    380.0
              Pasha   150.00      1
Education     Alona   200.00      1    200.0
Restaurants   Pasha   177.00      2    190.0
              Alona    13.00      1
Clothes       Alona   125.00      1    147.0
              Pasha    22.00      1
Presents      Pasha    70.00      1     70.0
Health        Pasha    33.00      1     33.0
Transport     Pasha    32.50      1     32.5

         Price  Price_apt
Who
Pasha  4246.08    7171.08
Alona  3453.75    6378.75

In [ ]:
test.annual_report(year=2024)

In [9]:
test.info_by_period(date_beg="09/02/2024", date_end="17/03/2024")

Spendings in 09/02/2024 - 17/03/2024: 19077.11 sheckels
Spendings in 09/02/2024 - 17/03/2024 with the appartment: 24777.11 sheckels

                 Price  Count
Category
Home           7393.05     15
Health         2906.35     17
Grocery        2616.02     20
Restaurants    1614.80     15
Fuel           1256.72      5
Presents       1007.00      6
Utility bills   881.86      4
Treatment       789.61      7
Parking         285.00      5
SuperPharm      176.70      3
Beauty          150.00      1

          Price  Price_apt
Who
Pasha  11375.93   14225.93
Alona   7701.18   10551.18

In [10]:
test.info_by_month(year=2025, month=1)

Spendings in January 2025: 9942.98 sheckels
Spendings in January 2025 with the appartment: 15792.98 sheckels

                       Price  Count    Total
Category      Who
Grocery       Pasha  1299.23      6  1945.23
              Alona   646.00      6
Beauty        Alona  1280.00      4   1480.0
              Pasha   200.00      2
Home          Alona   597.00      4   1077.0
              Pasha   480.00      3
Treatment     Alona   827.70      4  1069.16
              Pasha   241.46      3
Utility bills Alona   534.00      2   1068.0
              Pasha   534.00      2
Health        Pasha   604.15      4   872.15
              Alona   268.00      3
Presents      Alona   477.00      2    828.0
              Pasha   351.00      3
Fuel          Pasha   784.54      3   784.54
Entertainment Alona   280.00      1    280.0
Auto          Pasha   200.00      1    200.0
Restaurants   Pasha   119.70      1    119.7
Clothes       Pasha   100.00      1    100.0
Other         Pasha    89.20      1     89.2
Parking       Pasha    30.00      1     30.0

         Price  Price_apt
Who
Pasha  5033.28    7958.28
Alona  4909.70    7834.70

In [10]:
test.info_by_year(2024)

Spendings in 2024: 79879.06 sheckels
Spendings in 2024 with the appartment: 119779.06 sheckels

                  Price  Count
Category
Grocery        17316.01    149
Health         14920.35     77
Home           11715.23     60
Presents        6819.40     28
Fuel            6196.45     25
Restaurants     6139.20     66
Beauty          4674.00     20
Utility bills   3602.06     23
Treatment       3455.76     40
Entertainment   1930.00      7
Parking          962.00     22
Clothes          737.00      3
Education        534.00      7
Goverment        400.00      2
SuperPharm       272.60      4
Auto             189.00      3
Other             16.00      1

          Price  Price_apt
Who
Pasha  48586.47   68536.47
Alona  31292.59   51242.59